---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.SubRegionFailures
source: html/da08085c-3c91-d0cc-0b94-117b82fa132c.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SubRegionFailures

## Syntax (C#)
```csharp
public static class SubRegionFailures
```